cats/app/controllers/cats_controller.rb

  def index
    @cats = Cat.all
---
SELECT "cats".* FROM "cats"

  def show
    # byebug
    @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    cat = Cat.new(cat_params)

    if cat.save!
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    cat = Cat.find(params[:id])

    if cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "Brown"], ["description", "the cutest ever and I looooove theo"], ["updated_at", "2018-11-13 23:37:13.580760"], ["id", 3]]

  def edit
    @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]